# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты 
# вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть. 
# С клавиатуры вводятся число монет и сами монеты построчно.
# Пример:
# Ввод: 1 1 1 1 0 0 -> 2

number_of_coins = int(input('Введите количество монеток: '))
count_heads = 0
count_tails = 0
for i in range(number_of_coins):
    coin = int(input('Введите монеты, орел "0" или решка "1" '))
    if coin == 0:
        count_heads += 1
    else:
        count_tails += 1
if count_heads > count_tails:
    print(count_tails)
else:
    print(count_heads)