# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S 
# и их произведение P. Помогите Кате отгадать задуманные Петей числа.
# Пример:
# Ввод: 5 6 -> 2 3

sum = int(input('Введите чему равна сумма двух чисел: '))
multi = int(input('Введите чему равно произведение двух чисел: '))
discr = sum**2 - 4*multi
if discr >= 0:
    x = (sum - (discr**0.5)) / 2
    y = (sum + (discr**0.5)) / 2
    print(x, y)
else:
    print('Невозможно вычислить!')